wrk+async/get-CPU.log
./wrk2/wrk -t4 -c4 -d120s -R10000 -s get.lua --latency http://localhost:8080
Running 2m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.101ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.073ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.087ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.083ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.05ms  547.76us  20.45ms   63.94%
    Req/Sec     2.62k   256.09     8.11k    63.16%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.04ms
 75.000%    1.45ms
 90.000%    1.77ms
 99.000%    1.97ms
 99.900%    2.48ms
 99.990%   13.30ms
 99.999%   19.07ms
100.000%   20.46ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.089     0.000000            2         1.00
       0.322     0.100000       110042         1.11
       0.540     0.200000       220461         1.25
       0.756     0.300000       330315         1.43
       0.936     0.400000       440802         1.67
       1.045     0.500000       550849         2.00
       1.098     0.550000       605036         2.22
       1.154     0.600000       661033         2.50
       1.229     0.650000       715135         2.86
       1.337     0.700000       770211         3.33
       1.445     0.750000       825280         4.00
       1.498     0.775000       852527         4.44
       1.552     0.800000       880283         5.00
       1.606     0.825000       907727         5.71
       1.661     0.850000       935212         6.67
       1.714     0.875000       962730         8.00
       1.741     0.887500       976465         8.89
       1.768     0.900000       990073        10.00
       1.795     0.912500      1003802        11.43
       1.822     0.925000      1017758        13.33
       1.848     0.937500      1031207        16.00
       1.862     0.943750      1038260        17.78
       1.876     0.950000      1045423        20.00
       1.889     0.956250      1052156        22.86
       1.903     0.962500      1059084        26.67
       1.917     0.968750      1065644        32.00
       1.924     0.971875      1069088        35.56
       1.931     0.975000      1072463        40.00
       1.938     0.978125      1076024        45.71
       1.945     0.981250      1079695        53.33
       1.952     0.984375      1083069        64.00
       1.955     0.985938      1084638        71.11
       1.959     0.987500      1086430        80.00
       1.963     0.989062      1088031        91.43
       1.968     0.990625      1089659       106.67
       1.974     0.992188      1091350       128.00
       1.978     0.992969      1092284       142.22
       1.982     0.993750      1093139       160.00
       1.987     0.994531      1094037       182.86
       1.993     0.995313      1094853       213.33
       2.001     0.996094      1095692       256.00
       2.006     0.996484      1096103       284.44
       2.012     0.996875      1096515       320.00
       2.020     0.997266      1096964       365.71
       2.030     0.997656      1097357       426.67
       2.051     0.998047      1097798       512.00
       2.069     0.998242      1098004       568.89
       2.105     0.998437      1098217       640.00
       2.199     0.998633      1098431       731.43
       2.327     0.998828      1098644       853.33
       2.503     0.999023      1098858      1024.00
       2.625     0.999121      1098966      1137.78
       2.775     0.999219      1099075      1280.00
       2.949     0.999316      1099181      1462.86
       3.219     0.999414      1099288      1706.67
       3.743     0.999512      1099395      2048.00
       4.219     0.999561      1099449      2275.56
       5.039     0.999609      1099503      2560.00
       5.915     0.999658      1099557      2925.71
       7.115     0.999707      1099610      3413.33
       8.463     0.999756      1099664      4096.00
       9.095     0.999780      1099691      4551.11
       9.927     0.999805      1099719      5120.00
      10.767     0.999829      1099745      5851.43
      11.551     0.999854      1099771      6826.67
      12.471     0.999878      1099798      8192.00
      12.983     0.999890      1099812      9102.22
      13.383     0.999902      1099825     10240.00
      13.943     0.999915      1099839     11702.86
      14.463     0.999927      1099852     13653.33
      15.015     0.999939      1099865     16384.00
      15.327     0.999945      1099872     18204.44
      15.663     0.999951      1099879     20480.00
      15.967     0.999957      1099886     23405.71
      16.255     0.999963      1099892     27306.67
      16.799     0.999969      1099899     32768.00
      17.039     0.999973      1099902     36408.89
      17.343     0.999976      1099906     40960.00
      17.615     0.999979      1099909     46811.43
      17.903     0.999982      1099912     54613.33
      18.239     0.999985      1099916     65536.00
      18.479     0.999986      1099917     72817.78
      18.767     0.999988      1099919     81920.00
      19.071     0.999989      1099921     93622.86
      19.087     0.999991      1099922    109226.67
      19.375     0.999992      1099924    131072.00
      19.567     0.999993      1099925    145635.56
      19.663     0.999994      1099926    163840.00
      19.855     0.999995      1099927    187245.71
      19.855     0.999995      1099927    218453.33
      19.887     0.999996      1099928    262144.00
      19.951     0.999997      1099929    291271.11
      19.951     0.999997      1099929    327680.00
      20.175     0.999997      1099930    374491.43
      20.175     0.999998      1099930    436906.67
      20.175     0.999998      1099930    524288.00
      20.223     0.999998      1099931    582542.22
      20.223     0.999998      1099931    655360.00
      20.223     0.999999      1099931    748982.86
      20.223     0.999999      1099931    873813.33
      20.223     0.999999      1099931   1048576.00
      20.463     0.999999      1099932   1165084.44
      20.463     1.000000      1099932          inf
#[Mean    =        1.050, StdDeviation   =        0.548]
#[Max     =       20.448, Total count    =      1099932]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1199975 requests in 2.00m, 78.86MB read
  Non-2xx or 3xx responses: 1092300
Requests/sec:   9999.88
Transfer/sec:    672.94KB