wrk+async/get-alloc.log
./wrk2/wrk -t4 -c4 -d120s -R10000 -s get.lua --latency http://localhost:8080
Running 2m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.042ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.060ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.041ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.043ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.06ms    0.92ms  58.66ms   97.39%
    Req/Sec     2.62k   263.81     9.89k    64.72%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.04ms
 75.000%    1.44ms
 90.000%    1.77ms
 99.000%    1.97ms
 99.900%    3.24ms
 99.990%   44.86ms
 99.999%   56.45ms
100.000%   58.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.086     0.000000            2         1.00
       0.321     0.100000       110260         1.11
       0.537     0.200000       220072         1.25
       0.755     0.300000       330411         1.43
       0.932     0.400000       440053         1.67
       1.042     0.500000       550712         2.00
       1.096     0.550000       605706         2.22
       1.151     0.600000       660360         2.50
       1.225     0.650000       715050         2.86
       1.333     0.700000       770199         3.33
       1.442     0.750000       825406         4.00
       1.496     0.775000       852933         4.44
       1.549     0.800000       880129         5.00
       1.604     0.825000       907873         5.71
       1.658     0.850000       935292         6.67
       1.710     0.875000       962665         8.00
       1.738     0.887500       976473         8.89
       1.766     0.900000       990384        10.00
       1.793     0.912500      1003902        11.43
       1.819     0.925000      1017886        13.33
       1.845     0.937500      1031381        16.00
       1.858     0.943750      1038109        17.78
       1.872     0.950000      1045189        20.00
       1.885     0.956250      1051878        22.86
       1.900     0.962500      1059038        26.67
       1.913     0.968750      1065612        32.00
       1.921     0.971875      1069432        35.56
       1.928     0.975000      1072661        40.00
       1.935     0.978125      1076165        45.71
       1.942     0.981250      1079499        53.33
       1.950     0.984375      1083250        64.00
       1.953     0.985938      1084569        71.11
       1.957     0.987500      1086225        80.00
       1.962     0.989062      1088013        91.43
       1.967     0.990625      1089723       106.67
       1.973     0.992188      1091339       128.00
       1.977     0.992969      1092224       142.22
       1.982     0.993750      1093173       160.00
       1.987     0.994531      1093986       182.86
       1.994     0.995313      1094881       213.33
       2.002     0.996094      1095661       256.00
       2.008     0.996484      1096128       284.44
       2.015     0.996875      1096544       320.00
       2.024     0.997266      1096926       365.71
       2.041     0.997656      1097367       426.67
       2.085     0.998047      1097794       512.00
       2.161     0.998242      1098003       568.89
       2.281     0.998437      1098213       640.00
       2.473     0.998633      1098429       731.43
       2.763     0.998828      1098643       853.33
       3.421     0.999023      1098857      1024.00
       4.499     0.999121      1098965      1137.78
       5.987     0.999219      1099072      1280.00
       7.987     0.999316      1099180      1462.86
      10.415     0.999414      1099287      1706.67
      13.735     0.999512      1099394      2048.00
      16.335     0.999561      1099449      2275.56
      20.015     0.999609      1099502      2560.00
      23.711     0.999658      1099556      2925.71
      27.391     0.999707      1099609      3413.33
      31.199     0.999756      1099663      4096.00
      33.023     0.999780      1099690      4551.11
      35.007     0.999805      1099717      5120.00
      37.567     0.999829      1099744      5851.43
      39.903     0.999854      1099770      6826.67
      42.527     0.999878      1099797      8192.00
      43.871     0.999890      1099811      9102.22
      45.151     0.999902      1099824     10240.00
      46.303     0.999915      1099838     11702.86
      47.551     0.999927      1099851     13653.33
      48.767     0.999939      1099864     16384.00
      49.439     0.999945      1099871     18204.44
      50.463     0.999951      1099878     20480.00
      51.487     0.999957      1099885     23405.71
      52.351     0.999963      1099891     27306.67
      53.279     0.999969      1099898     32768.00
      53.823     0.999973      1099902     36408.89
      54.399     0.999976      1099906     40960.00
      54.719     0.999979      1099908     46811.43
      55.263     0.999982      1099911     54613.33
      55.871     0.999985      1099916     65536.00
      55.871     0.999986      1099916     72817.78
      56.159     0.999988      1099918     81920.00
      56.447     0.999989      1099920     93622.86
      56.735     0.999991      1099922    109226.67
      57.023     0.999992      1099924    131072.00
      57.023     0.999993      1099924    145635.56
      57.279     0.999994      1099925    163840.00
      57.311     0.999995      1099926    187245.71
      57.311     0.999995      1099926    218453.33
      57.567     0.999996      1099927    262144.00
      57.823     0.999997      1099928    291271.11
      57.823     0.999997      1099928    327680.00
      58.111     0.999997      1099929    374491.43
      58.111     0.999998      1099929    436906.67
      58.111     0.999998      1099929    524288.00
      58.399     0.999998      1099930    582542.22
      58.399     0.999998      1099930    655360.00
      58.399     0.999999      1099930    748982.86
      58.399     0.999999      1099930    873813.33
      58.399     0.999999      1099930   1048576.00
      58.687     0.999999      1099931   1165084.44
      58.687     1.000000      1099931          inf
#[Mean    =        1.061, StdDeviation   =        0.915]
#[Max     =       58.656, Total count    =      1099931]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1199976 requests in 2.00m, 78.86MB read
  Non-2xx or 3xx responses: 1092299
Requests/sec:   9999.87
Transfer/sec:    672.94KB